tests/TestData/StripeWebhook/ApiResponse/bt_list_success_with_more.json

{
  "object": "list",
  "data": [
    {
      "id": "txn_2H4Rt9KkGuKkxwBNtVRZeh5w",
      "object": "balance_transaction",
      "amount": 699,
      "available_on": 1595203201,
      "created": 1594647610,
      "currency": "gbp",
      "description": null,
      "exchange_rate": null,
      "fee": 29,
      "fee_details": [
        {
          "amount": 30,
          "application": null,
          "currency": "gbp",
          "description": "Stripe processing fees",
          "type": "stripe_fee"
        }
      ],
      "net": 669,
      "reporting_category": "charge",
      "source": "ch_externalId_124",
      "status": "available",
      "type": "payment"
    }
  ],
  "has_more": true,
  "url": "/v1/balance_transactions"
}
